Plan that hangs
```

  # module.aks_cluster_name.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + automatic_channel_upgrade           = "patch"
      + azure_policy_enabled                = true
      + disk_encryption_set_id              = "/subscriptions/1b0f918f-3c13-43ad-b400-436773701221/resourceGroups/logsrlife-events-prod/providers/Microsoft.Compute/diskEncryptionSets/des"
      + dns_prefix                          = "cwd"
      + fqdn                                = (known after apply)
      + http_application_routing_enabled    = false
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.26"
      + local_account_disabled              = false
      + location                            = "eastus"
      + name                                = "logsrlife-events-prod"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = false
      + resource_group_name                 = "logsrlife-events-prod"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + workload_identity_enabled           = true

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "8df18126-81a9-4cc6-b18f-23f2941e81de",
            ]
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling    = true
          + enable_host_encryption = false
          + enable_node_public_ip  = false
          + kubelet_disk_type      = (known after apply)
          + max_count              = 3
          + max_pods               = 100
          + min_count              = 1
          + name                   = "system"
          + node_count             = (known after apply)
          + node_labels            = (known after apply)
          + orchestrator_version   = (known after apply)
          + os_disk_size_gb        = 30
          + os_disk_type           = "Managed"
          + os_sku                 = (known after apply)
          + scale_down_mode        = "Delete"
          + tags                   = {
              + "Environment"   = "production"
              + "GitRepository" = "https://github.com/logsrlife/terragrunt-it-infra.git"
              + "Project"       = "infra"
              + "Role"          = "tenants"
            }
          + type                   = "VirtualMachineScaleSets"
          + ultra_ssd_enabled      = false
          + vm_size                = "Standard_B2s"
          + workload_runtime       = (known after apply)
          + zones                  = [
              + "1",
              + "2",
              + "3",
            ]
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/1b0f918f-3c13-43ad-b400-436773701221/resourceGroups/logsrlife-events-prod/providers/Microsoft.ManagedIdentity/userAssignedIdentities/logsrlife-events-prod-identity",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_name                         = "cwd-agw"
          + ingress_application_gateway_identity = (known after apply)
          + subnet_id                            = "/subscriptions/1b0f918f-3c13-43ad-b400-436773701221/resourceGroups/logsrlife-events-prod/providers/Microsoft.Network/virtualNetworks/vnet/subnets/ag"
        }

      + key_management_service {
          + key_vault_key_id         = "https://logsrlife-events-prodv.vault.azure.net/keys/etcdenc/2902b53310bc405dab1c7a84f2d2727a"
          + key_vault_network_access = "Private"
        }

      + maintenance_window {
          + allowed {
              + day   = "Sunday"
              + hours = [
                  + 22,
                  + 23,
                ]
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "azure"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }
```